/** @module config/transitionWords */

export const singleWords = [ "أخيرا", "وأخيرا", "إذا", "وإذا", "إذ", "وإذ", "إنما", "وإنما", "إما", "وإما", "أيضا", "وأيضا",
    "بالتالي", "وبالتالي", "بالطبع", "وبالطبع", "بسبب", "وبسبب", "بما", "وبما", "بينما", "وبينما",
    "ثم", "وثم", "حاليا", "وحاليا", "حين", "وحين", "خاصة", "وخاصة", "رغم", "ورغم", "ريثما", "وريثما",
    "سابقا", "وسابقا", "عندما", "وعندما", "قبل", "وقبل", "قد", "وقد", "كما", "وكما", "لكن", "ولكن",
    "لاسيما", "ولاسيما", "لأن", "ولأن", "لذلك", "ولذلك", "لما", "ولما", "مثلا", "ومثلا", "مع ذلك", "ومع ذلك",
    "منذ", "ومنذ", "نظرا", "ونظرا", "هكذا", "وهكذا", "أما", "وأما", "أو", "وأو", "أم", "وأم", "حيثما", "وحيثما",
    "كيفما", "وكيفما", "أيما", "وأيما", "أيّما", "بين", "وبين", "تحديدا", "وتحديدا", "عموما", "وعموما",
    "خصوصا", "وخصوصا", "بالأخص", "وبالأخص", "بالمثل", "وبالمثل", "فعلًلا", "وفعلا", "تباعا", "وتباعا",
    "لاحقا", "ولاحقا", "ورغم", "ومع", "كذلك", "وكذلك" ];
export const multipleWords = [     "إلا إذا", "وإلا إذا", "إلا أن", "وإلا أن", "إلى أن", "وإلى أن", "إلى الأبد", "وإلى الأبد",
    "بعد ذلك", "وبعد ذلك", "بما أن", "وبما أن", "بما فيه", "وبما فيه", "حتى لا", "وحتى لا", "حتى لو", "وحتى لو",
    "على الرغم من", "وعلى الرغم من", "على سبيل المثال", "وعلى سبيل المثال", "على وجه الخصوص", "وعلى وجه الخصوص",
    "على وجه التحديد", "وعلى وجه التحديد", "على عكس ذلك", "وعلى عكس ذلك", "على المدى القصير", "وعلى المدى القصير",
    "على المدى الطويل", "وعلى المدى الطويل", "علاوة على ذلك", "وعلاوة على ذلك", "في الوقت الحالي", "وفي الوقت الحالي",
    "في نهاية المطاف", "وفي نهاية المطاف", "في الحقيقة", "وفي الحقيقة", "في الواقع", "وفي الواقع", "في هذا السياق", "وفي هذا السياق",
    "قبل كل شيء", "وقبل كل شيء", "كذلك الأمر", "وكذلك الأمر", "ما عدا", "وما عدا", "مع أن", "ومع أن", "مع ذلك", "ومع ذلك",
    "من أجل", "ومن أجل", "من أجل أن", "ومن أجل أن", "من جهة أخرى", "ومن جهة أخرى", "من ناحية أخرى", "ومن ناحية أخرى",
    "من ثم", "ومن ثم", "نتيجة لذلك", "ونتيجة لذلك", "نتيجة لما سبق", "ونتيجة لما سبق", "لهذا السبب", "ولهذا السبب",
    "وفي الوقت نفسه", "بناء على ذلك", "وبناء على ذلك", "بصرف النظر عن", "وبصرف النظر عن", "بصفة عامة", "وبصفة عامة",
    "زيادة على ذلك", "وزيادة على ذلك", "من هنا", "ومن هنا", "في نفس الوقت", "وفي نفس الوقت", "رغم كل ذلك", "ورغم كل ذلك",
    "بناء على ما سبق", "وبناء على ما سبق", "من هنا نفهم أن", "ومن هنا نفهم أن", "في حالة", "وفي حالة", "في أقرب وقت", "وفي أقرب وقت",
   "على أي حال", "وعلى أي حال" , "وفي الوقت ذاته" ,"في الوقت ذاته" , "على صعيد", "وعلى صعيد",
    "على صعيد آخر", "وعلى صعيد آخر", "على صعيد محلي", "وعلى صعيد محلي",  "على صعيد دولي", "وعلى صعيد دولي",
    "على مستوى", "وعلى مستوى", "على مستوى محلي", "وعلى مستوى محلي",
    "على مستوى دولي", "وعلى مستوى دولي", "على المستوى الوطني", "وعلى المستوى الوطني",
    "على المستوى المحلي", "وعلى المستوى المحلي", "على المستوى الإقليمي", "وعلى المستوى الإقليمي",
    "على المستوى العالمي", "وعلى المستوى العالمي", "على الصعيد ذاته", "وعلى الصعيد ذاته",
    "على الصعيد نفسه", "وعلى الصعيد نفسه", "على نطاق واسع", "وعلى نطاق واسع",
    "على نطاق ضيق", "وعلى نطاق ضيق"
 ];

export const allWords = singleWords.concat( multipleWords );

export default allWords;
